Revit 2026 API

# VectorAtPoint Methods

---

The VectorAtPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ClearAllFlags | Sets flags for all measurements to ValueAtPointFlags::None. (Inherited from ValueAtPointBase) |
|  | ClearFlagsAt | Sets flags for the given measurement to ValueAtPointFlags::None. (Inherited from ValueAtPointBase) |
|  | Dispose | (Inherited from ValueAtPointBase) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetFlags | Returns flags for the given measurement. (Inherited from ValueAtPointBase) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetFlags(IListInt32) | (Inherited from ValueAtPointBase) |
|  | SetFlags(Int32) | Sets the flags associated to all measurements to the same value. (Inherited from ValueAtPointBase) |
|  | SetFlags(Int32, Int32) | Sets the flags associated to a given measurement. (Inherited from ValueAtPointBase) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

VectorAtPoint Class

Autodesk.Revit.DB.Analysis Namespace